
local Level = Level or {}

-- 1-2 400
-- 2-3 400 + 600
--local EXP = {400,600,800,1000,1200,1400,1600,1800,2000,
--    2200,2400,2600,2800,3000,3200,3400,3600,3800,4000,
--    4200,4400,4600,4800,5000,5200,5400,5600,5800,6000,
--    6200,6400,6600,6800,7000,7200,7400,7600,7800,8000,
--    8200,8400,8600,8800,9000,9200,9400,9600,9800,10000}

--local EXP = {0,50,300,650,1100,1650,2300,3050,3900,4850,
--    5950,7150,8450,9850,11350,12950,14650,16450,
--    18850,20350,22550,24950,27550,30350,33350,36750,
--    40550,44750,49750,54350,59850,65850,72450,79250,
--    86250,93450,100850,108450,116250,125250,132450,
--    142650,151250,160050,169050,178250,187650,197250,
--    207050,217050 }

local EXP = {0,50,150,300,500,1050,1700,2450,3300,4250,
    5350,6550,7850,9250,10750,12350,14050,15850,18250,
    19750,21950,24350,26950,29750,32750,36150,39950,
    44150,49150,53750,59250,65250,71850,78650,85650,
    92850,100250,107850,115650,124650,131850,142050,
    150650,159450,168450,177650,187050,196650,206450,
    216450,227450,239450,252450,266450,281450,297450,
    314450,332450,351450,371450}

--通过总经验获得等级
function Level.getLevel(exp)
    for i = 1, 60 do
        if exp < EXP[i] then
            return i - 1
        end
    end
    return 60
end

--通过等级，获得当前等级需要经验
function Level.getLevelNeedExp(level)
    if level < 1 then
       return 0
    end

    if level > 59 then
        return EXP[60] - EXP[59]
    end

    return  EXP[level + 1] - EXP[level]
end

--通过等级和当前总经验，获得当前等级的当前经验
function Level.getLevelCurExp(level,totalExp)
    if level < 1 then
        level = 1
    end

    if level > 59 then
        return EXP[60] - EXP[59]
    end

    return   totalExp - EXP[level]
end

--获得当前等级经验百分比 (已乘以100)
function Level.getLevelPercent(level, totalExp)
    return  Level.getLevelCurExp(level,totalExp)/Level.getLevelNeedExp(level)*100
end

return Level